Revit 2027 API
EnergyAnalysisDetailModel.IncludeShadingSurfaces Property
 Indicates if to set and get the setting for if shading surfaces should be included.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IncludeShadingSurfaces { get; }
Public ReadOnly Property IncludeShadingSurfaces As Boolean
	Get
public:
property bool IncludeShadingSurfaces {
	bool get ();
}
member IncludeShadingSurfaces : bool with get
Property Value
Boolean
See Also
Reference
EnergyAnalysisDetailModel Class
Autodesk.Revit.DB.Analysis Namespace